app/controllers/api/follows_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "Scott"]]
---
  def show
    # byebug
    author = User.find_by(username: params[:id])