app/controllers/api/likes_controller.rb

  def create
    @like = Like.new(like_params)
    @like.user_id = current_user.id

    if @like.save
---
INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 12], ["user_id", 1], ["created_at", "2015-11-29 23:16:56.947541"], ["updated_at", "2015-11-29 23:16:56.947541"]]

  def destroy
    like = Like.find_by(user_id: current_user.id, post_id: params[:like][:post_id])
    like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2 LIMIT 1  [["user_id", 1], ["post_id", 12]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 98]]