app/controllers/api/locations_controller.rb

  def create
    @location = Location.new({place: params[:location]})
    if @location.save
      ### dangerous! ?
      post = current_user.posts.last
      post.location_id = @location.id
      post.save
---
INSERT INTO "locations" ("place", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["place", "Japan"], ["created_at", "2015-11-30 05:09:26.198381"], ["updated_at", "2015-11-30 05:09:26.198381"]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1  ORDER BY "posts"."id" DESC LIMIT 1  [["user_id", 1]]
UPDATE "posts" SET "location_id" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["location_id", 5], ["updated_at", "2015-11-30 05:09:26.276843"], ["id", 13]]

  def show
    render json: Location.find(params[:id]).as_json(only: [:id, :place])
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT 1  [["id", 4]]