app/controllers/api/location_posts_controller.rb

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT 1  [["id", 4]]
---
  def show

    @location = Location.find(params[:id])