app/controllers/api/posts_controller.rb

SELECT "follows".* FROM "follows" WHERE "follows"."user_id" = $1  [["user_id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" IN (3, 2, 1)  ORDER BY "posts"."created_at" DESC LIMIT 25 OFFSET 0
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (12, 11, 10, 9, 8, 7, 6, 5)
SELECT "locations".* FROM "locations" WHERE "locations"."id" IN (4, 3, 2, 1)
SELECT "users".* FROM "users" WHERE "users"."id" IN (1)
SELECT "posts".* FROM "posts" INNER JOIN "likes" ON "posts"."id" = "likes"."post_id" WHERE "likes"."user_id" = $1  [["user_id", 1]]
---
  def index
    if current_user
      followed_user_ids = current_user.follows.map(&:follower_id)

      page_number = params[:pageNum] || 1
      # .includes(:user, :location, comments: :user)
      @posts = Post.where(user_id: (followed_user_ids.push(current_user.id)))
      .includes(:location, :user, :likes, comments: :user)
      .includes(:user_likes)
      .order(created_at: :desc).page(page_number)
      @user_liked_posts = current_user.liked_posts.to_a

INSERT INTO "posts" ("caption", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["caption", "#asia"], ["user_id", 1], ["created_at", "2015-11-30 05:09:25.232864"], ["updated_at", "2015-11-30 05:09:25.232864"]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 13]]
SELECT "users".* FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."post_id" = $1  [["post_id", 13]]
INSERT INTO "tags" ("tag_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["tag_name", "asia"], ["created_at", "2015-11-30 05:09:25.544923"], ["updated_at", "2015-11-30 05:09:25.544923"]]
---
  def create
    location_name = params[:location]
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    if @post.save
      @post.parse_tags
      @user_liked_posts = current_user.liked_posts.to_a
      if location_name.length >= 3
        url = HTTParty.get("https://maps.googleapis.com/maps/api/geocode/json?address=#{URI.escape(location_name)}&key=#{ENV['GEOCODE_API_KEY']}",
        :headers => { 'ContentType' => 'application/json' } )
        response = JSON.parse(url.body)
        loc_response = response["results"][0]["address_components"][0]["long_name"] rescue nil
        unless loc_response.nil?
          location_name = loc_response

          @location = Location.new({place: location_name})
          if @location.save
            @post.location_id = @location.id
            @post.save