app/controllers/api/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "Scott"]]
---
  def create

    if params[:username] == "Guest"
      @user = User.find_by(username: "Guest")