app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "body", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "Scott"]]
---
  def show

    @user = User.find_by(username: params[:id])

UPDATE "users" SET "body" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["body", "hello!"], ["updated_at", "2015-11-30 00:15:10.589922"], ["id", 4]]
---
  def update
    @user = current_user
    if params[:user][:user_pic]
      if @user.update_attribute(:user_pic, params[:user][:user_pic])