app/views/api/likes/show.json.jbuilder

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 12]]
---
json.userLikes post.user_likes.as_json(only: [:id, :username])
json.numLikes post.likes.length