app/views/api/posts/_post.json.jbuilder

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (12, 11, 10, 9, 8, 7, 6, 5)
---

json.numLikes post.likes.length

INSERT INTO "posts" ("caption", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["caption", "#asia"], ["user_id", 1], ["created_at", "2015-11-30 05:09:25.232864"], ["updated_at", "2015-11-30 05:09:25.232864"]]
---
# json.created_at do
elapsed = ((Time.now - post.created_at.time) / 60).to_i

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1  ORDER BY "comments"."id" DESC LIMIT 25  [["post_id", 13]]
---

arr = post.comments.last(25).map do |comment|