app/views/api/posts/show.json.jbuilder

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 12]]
---

json.numLikes @post.likes.count

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1  ORDER BY "comments"."id" DESC LIMIT 25  [["post_id", 12]]
---

arr = @post.comments.includes(:user).last(25).map do |comment|