app/views/api/users/show.json.jbuilder

if @posts
    json.numPosts @user.posts.length
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 4]]