app/controllers/omniauth_controller.rb

  def facebook
    @user = User.find_or_create_by_auth_hash(request.env['omniauth.auth'])
---
INSERT INTO "users" ("username", "provider", "uid", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"